# Pandas DataFrame basics

In [1]:
import pandas as pd
import numpy as np

In [2]:
oil = pd.read_csv("../pandas-course/Pandas Course Resources/retail/oil.csv")

In [5]:
oil.shape

(1218, 2)

In [6]:
oil.size

2436

In [7]:
oil.index

RangeIndex(start=0, stop=1218, step=1)

In [8]:
oil.columns

Index(['date', 'dcoilwtico'], dtype='object')

In [9]:
oil.axes

[RangeIndex(start=0, stop=1218, step=1),
 Index(['date', 'dcoilwtico'], dtype='object')]

In [10]:
oil.head()

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20

In [11]:
oil.tail()

            date  dcoilwtico
1213  2017-08-25       47.65
1214  2017-08-28       46.40
1215  2017-08-29       46.46
1216  2017-08-30       45.96
1217  2017-08-31       47.26

In [29]:
oil.sample(10)

            date  dcoilwtico
618   2015-05-15       59.73
851   2016-04-06       37.74
1148  2017-05-26       49.58
322   2014-03-27      101.25
735   2015-10-27       43.21
401   2014-07-16      101.88
1185  2017-07-18       46.40
159   2013-08-12      106.19
191   2013-09-25      102.68
629   2015-06-01       60.24

In [31]:
oil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1218 non-null   object
 1   dcoilwtico  1175 non-null   float64
dtypes: float64(1), object(1)
memory usage: 19.2+ KB

In [33]:
oil.describe()

        dcoilwtico
count  1175.000000
mean     67.714366
std      25.630476
min      26.190000
25%      46.405000
50%      53.190000
75%      95.660000
max     110.620000

Course assignment: exploring DataFrames

In [164]:
df = pd.read_csv("../pandas-course/Pandas Course Resources/retail/transactions.csv")

In [39]:
print(df.shape[0])
print(df.columns)
print(df.dtypes)

83488
Index(['date', 'store_nbr', 'transactions'], dtype='object')
date            object
store_nbr        int64
transactions     int64
dtype: object

In [41]:
df.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  object
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB

In [45]:
df.loc[:,"date"].nunique()

1682

In [47]:
df.loc[:,"transactions"].describe()

count    83488.000000
mean      1694.602158
std        963.286644
min          5.000000
25%       1046.000000
50%       1393.000000
75%       2079.000000
max       8359.000000
Name: transactions, dtype: float64

In [49]:
df.loc[:,[col for col in df.columns if col != "date"]]

       store_nbr  transactions
0             25           770
1              1          2111
2              2          2358
3              3          3487
4              4          1922
...          ...           ...
83483         50          2804
83484         51          1573
83485         52          2255
83486         53           932
83487         54           802

[83488 rows x 2 columns]

In [50]:
df.loc[:,"store_nbr"].nunique()

54

In [56]:
str(round((df["transactions"].sum()/1_000_000),1)) + " milion"

'141.5 milion'

In [69]:
df.drop(labels=[col for col in df.columns if "o"  in col],axis=1)

             date
0      2013-01-01
1      2013-01-02
2      2013-01-02
3      2013-01-02
4      2013-01-02
...           ...
83483  2017-08-15
83484  2017-08-15
83485  2017-08-15
83486  2017-08-15
83487  2017-08-15

[83488 rows x 1 columns]

In [78]:
df.duplicated(subset="date")

0        False
1        False
2         True
3         True
4         True
         ...
83483     True
83484     True
83485     True
83486     True
83487     True
Length: 83488, dtype: bool

In [87]:
df.shape[0] / df.drop_duplicates(subset="date").duplicated(subset="date").size

49.63614744351962

In [92]:
df.shape[0] / df["date"].nunique()

49.63614744351962

In [94]:
df

             date  store_nbr  transactions
0      2013-01-01         25           770
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83488 rows x 3 columns]

In [98]:
df.drop(labels=[0],inplace=True)

In [101]:
df.drop(labels="date",axis=1)

       store_nbr  transactions
1              1          2111
2              2          2358
3              3          3487
4              4          1922
5              5          1903
...          ...           ...
83483         50          2804
83484         51          1573
83485         52          2255
83486         53           932
83487         54           802

[83487 rows x 2 columns]

In [104]:
df.drop_duplicates(subset="store_nbr",keep="last").head()

             date  store_nbr  transactions
83434  2017-08-15          1          1693
83435  2017-08-15          2          1737
83436  2017-08-15          3          2956
83437  2017-08-15          4          1283
83438  2017-08-15          5          1310

In [111]:
oil.isna().sum()

date           0
dcoilwtico    43
dtype: int64

In [119]:
oil.dropna(subset="dcoilwtico")

            date  dcoilwtico
1     2013-01-02       93.14
2     2013-01-03       92.97
3     2013-01-04       93.12
4     2013-01-07       93.20
5     2013-01-08       93.21
...          ...         ...
1213  2017-08-25       47.65
1214  2017-08-28       46.40
1215  2017-08-29       46.46
1216  2017-08-30       45.96
1217  2017-08-31       47.26

[1175 rows x 2 columns]

In [121]:
oil.isna().sum()

date           0
dcoilwtico    43
dtype: int64

In [125]:
oil.fillna({"dcoilwtico":0})["dcoilwtico"].mean()

65.32379310344828

In [127]:
oil["dcoilwtico"].mean()

67.71436595744682

In [129]:
store25 = df.loc[df["store_nbr"] == 25]

In [143]:
df.groupby(["date","store_nbr"])["transactions"].sum() > 2000

date        store_nbr
2013-01-02  1             True
            2             True
            3             True
            4            False
            5            False
                         ...
2017-08-15  50            True
            51           False
            52            True
            53           False
            54           False
Name: transactions, Length: 83487, dtype: bool

In [155]:
(df["transactions"] > 2000).value_counts(normalize=True).loc[True]

0.266808006036868

In [159]:
store25.loc[store25["transactions"] > 2000,"transactions"].sum()

144903

In [171]:
df.loc[(df["store_nbr"].isin([25,31])) & (df["date"].str.slice(-5,-3).isin(["05","06"])) & (df["transactions"] < 2000),"transactions"].sum()

644910

In [177]:
df["date"].str.slice(-4,-3)

0        1
1        1
2        1
3        1
4        1
        ..
83483    8
83484    8
83485    8
83486    8
83487    8
Name: date, Length: 83488, dtype: object

In [179]:
df

             date  store_nbr  transactions
0      2013-01-01         25           770
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83488 rows x 3 columns]

In [200]:
df2 = df.copy()
df2.loc[df["date"] == "2013-01-01"] = 2001
df2.groupby("date").apply(lambda x: (x["transactions"] > 2000).all(), include_groups=False)

date
2001           True
2013-01-02    False
2013-01-03    False
2013-01-04    False
2013-01-05    False
              ...
2017-08-11    False
2017-08-12    False
2017-08-13    False
2017-08-14    False
2017-08-15    False
Length: 1682, dtype: bool

In [201]:
df.groupby("store_nbr")["transactions"].sum()

store_nbr
1     2553963
2     3219901
3     5366350
4     2519007
5     2347877
6     3065896
7     2995993
8     4637971
9     3516162
10    1652493
11    3972488
12    1958852
13    1572504
14    2287850
15    2209898
16    1464498
17    2295485
18    2071278
19    2107489
20    1422539
21     842891
22     504156
23    1788171
24    3568206
25    1520362
26    1065059
27    2485687
28    1957594
29     981448
30    1171130
31    2306044
32    1065226
33    1743003
34    3864018
35    1123889
36    1738129
37    2481719
38    2867052
39    2389482
40    2181195
41    1764146
42     802646
43    2182356
44    7273093
45    6201115
46    5990113
47    6535810
48    5107785
49    4574103
50    4384444
51    2873614
52     275393
53    1180082
54    1451290
Name: transactions, dtype: int64

In [205]:
df.sort_values(by=["transactions"],ascending=False)[["date","transactions"]]

             date  transactions
52011  2015-12-23          8359
71010  2016-12-23          8307
16570  2013-12-23          8256
33700  2014-12-23          8120
16572  2013-12-23          8001
...           ...           ...
58003  2016-04-18            54
57950  2016-04-17            33
52428  2016-01-04            10
52392  2016-01-02             6
65479  2016-09-07             5

[83488 rows x 2 columns]

In [209]:
df.sort_values(by=["date","transactions"], ascending=[True,False])

             date  store_nbr  transactions
0      2013-01-01         25           770
40     2013-01-02         46          4886
38     2013-01-02         44          4821
39     2013-01-02         45          4208
41     2013-01-02         47          4161
...           ...        ...           ...
83455  2017-08-15         22           766
83449  2017-08-15         16           742
83465  2017-08-15         32           615
83468  2017-08-15         35           612
83459  2017-08-15         26           534

[83488 rows x 3 columns]

In [211]:
df.sort_index(axis=1, ascending=False)

       transactions  store_nbr        date
0               770         25  2013-01-01
1              2111          1  2013-01-02
2              2358          2  2013-01-02
3              3487          3  2013-01-02
4              1922          4  2013-01-02
...             ...        ...         ...
83483          2804         50  2017-08-15
83484          1573         51  2017-08-15
83485          2255         52  2017-08-15
83486           932         53  2017-08-15
83487           802         54  2017-08-15

[83488 rows x 3 columns]